<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8d0820f203e6e29f7bf28ff11404522d18565d156d9a9222e974c7bf49743dcb","plan_job_ref":"Job Create terraform plan #43 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7508073925","plan_out_hash":"518104bcc50e124bcf97f6ceadc048e04bfa84cdf1d3c417674767bcf25e2342","plan_hash":"a0807dae98b2893f2dd3be147ef96cca02c92bacef20666fe4909dbe974de6e5","plan_text_format":"diff","version":"1.41.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 4 to add, 2 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
!~  resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:950012193416:service/co-boomi-atom-cluster/co-boomi-atom-service"
        name                               = "co-boomi-atom-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:10" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:10" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      id                       = "*************" -> (known after apply)
!~      revision                 = 10 -> (known after apply)
-       tags                     = {} -> null
#        (9 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
!~  resource "aws_lambda_function" "this" {
!~      filename                       = "builds/241b1f7ae462f4a8751a57746e74c31eec966a480a4e274ea96d313b1cf5ce53.zip" -> "builds/3e45aee6a057e7dcc98eeb5378ec2d56c3fb2148bfa29c784ff4e18e38620856.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
!~      last_modified                  = "2023-12-13T22:49:34.000+0000" -> (known after apply)
!~      qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:26" -> (known after apply)
!~      qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:26/invocations" -> (known after apply)
        tags                           = {}
!~      version                        = "26" -> (known after apply)
#        (18 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!~      id                  = "*******" -> (known after apply)
!~      qualifier           = "26" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./lambda/rotate_install_token.py",
+                       null,
                    ],
+                   [
+                       "zip",
+                       "./lambda/package/",
+                       null,
                    ],
                ]
+               filename      = "builds/3e45aee6a057e7dcc98eeb5378ec2d56c3fb2148bfa29c784ff4e18e38620856.zip"
+               runtime       = "python3.11"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3e45aee6a057e7dcc98eeb5378ec2d56c3fb2148bfa29c784ff4e18e38620856.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "filename"  = "builds/241b1f7ae462f4a8751a57746e74c31eec966a480a4e274ea96d313b1cf5ce53.zip" -> "builds/3e45aee6a057e7dcc98eeb5378ec2d56c3fb2148bfa29c784ff4e18e38620856.zip"
!~          "timestamp" = "1702508765622397800" -> "1705098147215328000"
        }
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #43](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7508073925)